In [29]:
import numpy as np
import pandas as pd
from sklearn.impute import SimpleImputer

SimpleImputer is a class in scikit-learn (sklearn) that provides a straightforward way to handle missing data by imputing 
missing values with a specified constant or strategy. It is commonly used for data preprocessing when dealing with datasets 
that have missing values. Here are the key parameters of SimpleImputer:

SimpleImputer is a class in scikit-learn (sklearn) that provides a straightforward way to handle missing data by imputing 
missing values with a specified constant or strategy. It is commonly used for data preprocessing when dealing with datasets 
that have missing values. Here are the key parameters of SimpleImputer:

   (1). strategy: This parameter specifies the imputation strategy to be used. It accepts one of the following values:

        'mean': Imputes missing values using the mean value of the non-missing elements in the column.

        'median': Imputes missing values using the median value of the non-missing elements in the column.

        'most_frequent': Imputes missing values using the most frequent (mode) value in the column.

        'constant': Imputes missing values with a user-defined constant value, which should be specified using the fill_value 
                   parameter.

2. fill_value: This parameter is only applicable when the strategy is set to 'constant'. It allows you to specify the 
    constant value that will be used to replace missing values. For example, you can set fill_value=0 to replace missing 
    values with zeros.

3. missing_values: This parameter allows you to specify what should be considered as missing values in your dataset. By 
    default, it's set to np.nan (NumPy's representation of missing values), but you can change it to a different value 
    if your dataset uses a different representation for missing values.

4. verbose: If set to 0, it suppresses all output messages. If set to a positive integer, it controls the verbosity of the 
    imputer.

# Here's an example of how to use SimpleImputer with some of these parameters:

In [30]:
df=pd.read_csv('titanic_train.csv')

In [31]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [32]:
df.drop(columns=['PassengerId','Name','Ticket','Cabin'],inplace=True)

In [34]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [36]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

# train test split operation

In [39]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(df.drop(columns=['Survived']),df['Survived'],test_size=0.2,random_state=43)

In [42]:
x_train.head(2)

     Pclass   Sex   Age  SibSp  Parch     Fare Embarked
826       3  male   NaN      0      0  56.4958        S
838       3  male  32.0      0      0  56.4958        S

In [43]:
y_train.head(2)

826    0
838    1
Name: Survived, dtype: int64

In [44]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [49]:
si_age=SimpleImputer()
si_embarked=SimpleImputer(strategy='most_frequent')

In [59]:
x_train_age=si_age.fit_transform(x_train[['Age']])
x_train_Embarked=si_embarked.fit_transform(x_train[['Embarked']])


x_test_age=si_age.transform(x_train[['Age']])
x_test_embarked=si_embarked.transform(x_train[['Embarked']])

In [71]:
pd.DataFrame(x_train_age)

             0
0    30.167252
1    32.000000
2    36.000000
3    36.000000
4    30.167252
..         ...
707  30.167252
708  31.000000
709  29.000000
710  22.000000
711  21.000000

[712 rows x 1 columns]